<?php
$a=1;
$b=1.8;
$c=10>5;
$d="sdfsdfsd";
define("F", 132);
$e=F;


echo "$a"."<br>";
echo "$b"."<br>";
echo "$c"."<br>";
echo "$d"."<br>" ;
echo F."<br>";

echo '$a'."<br>";
echo '$b'."<br>";
echo '$c'."<br>";
echo '$d'."<br>";
echo '$e'."<br>";
echo '«Славная осень! Здоровый, ядреный'."<br>";
echo 'Воздух усталые силы бодрит;'."<br>";
echo 'Лед неокрепший на речке студеной'."<br>";
echo 'Словно как тающий сахар лежит.»'."<br>";
echo "<U>"."Н. А. Некрасов"."</U>"."<br>";

echo '«Славная осень! Здоровый, ядреный'."<br>".'Воздух усталые силы бодрит;'."<br>".'Лед неокрепший на речке студеной'."<br>".'Словно как тающий сахар лежит.»'."<br>"."<U>"."Н. А. Некрасов"."</U>"."<br>";

$n=10;
$m='20 приветов';
$x=$n+$m;
echo $x.'<br>';

$x1 = 10;
$y1 = 15;
$x1=$x1+5;
$y1=$y1-5;
echo $x1."<br>";
echo $y1."<br>";

$a1=0;
$b1=1;
$c1=$a1 xor $a1;
echo $c1."<br>";
$c2=$a1 xor $b1;
echo $c2."<br>";
$c3=$b1 xor $a1;
echo $c3."<br>";
$c4=$b1 xor $b1;
echo $c4."<br>";
?>