<?php
function trans($a)
{
$arr2=str_split($a);
$abc=array(
     "а"=>"a",
     "б"=>"b",
     "в"=>"v",
     "г"=>"g",
     "д"=>"d",
     "е"=>"e",
     "ё"=>"e",
     "ж"=>"zh",
     "з"=>"z",
     "и"=>"i",
     "й"=>"i",
     "к"=>"k",
     "л"=>"l",
     "м"=>"m",
     "н"=>"n",
     "о"=>"o",
     "п"=>"p",
     "р"=>"r",
     "с"=>"s",
     "т"=>"t",
     "у"=>"y",
     "ф"=>"f",
     "х"=>"h",
     "ц"=>"ts",
     "ч"=>"cg",
     "ш"=>"sh",
     "щ"=>"shch",
     "ь"=>"",
     "ы"=>"y",
     "э"=>"e",
     "ю"=>"yu",
     "я"=>"ya"
    );
$rez=NULL; //задаем пустую строку и обнуляем ее
foreach ($arr2 as $sIndex2 => $sVal2)  // перебор первого массива
{ 
    foreach ($abc as $sIndex1 => $sVal1) //цикл перебора второго массива
    {
        if ($sIndex1==$sVal2) // сравнение значений 1 и 2 массива, вывод результата
        {
	//echo "$sVal1";
	$rez1=$sVal1;
	$rez=$rez.$rez1;
        }
    }
} 
    return $rez; //возврат значения функции
}
echo trans("снег");
?>